spec/fixtures/echo_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/1999/XMLSchema"
  xmlns:namesp1="urn:Echo">
  <SOAP-ENV:Body>
    <namesp1:echo>
      <namesp1:whatToEcho>I am going to be echoed</namesp1:whatToEcho>
    </namesp1:echo>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
